/**************************************************************
 * @author reddragon
 * @date 2020/7/28
 * @brief 跳跃游戏2 hard
 * 这道题是典型的贪心算法，通过局部最优解得到全局最优解。
 * 如果我们「贪心」地进行正向查找，每次找到可到达的最远位置，
 * 就可以在线性时间内得到最少的跳跃次数。
 * 在具体的实现中，我们维护当前能够到达的最大下标位置，记为边界。
 * 我们从左到右遍历数组，到达边界时，更新边界并将跳跃次数增加 1。
 ************************************************************/
#include <iostream>
#include <vector>
#include <string>
#include <memory>
using namespace std;

/***************************************************************
在遍历数组时，我们不访问最后一个元素，这是因为在访问最后一个元素之前，
我们的边界一定大于等于最后一个位置，否则就无法跳到最后一个位置了。
如果访问最后一个元素，在边界正好为最后一个位置的情况下，
我们会增加一次「不必要的跳跃次数」，因此我们不必访问最后一个元素。
****************************************************************/
int jump(vector<int> &nums)
{
    int ans = 0, size = nums.size();
    int maxPos = 0;
    int oldPos = maxPos;
    for (int i = 0; i < size - 1; i++)
    {
        maxPos = max(maxPos, i + nums[i]);
        if (oldPos == i)
        {
            oldPos = maxPos;
            ans++;
        }
    }
    return ans;
}

int main()
{
    vector<int> nums{2, 1};
    cout << jump(nums) << endl;
    return 0;
}